/***************************************************************************//**
 *   @file   ADF7023.h
 *   @brief  Header file of ADF7023 Driver.
 *   @author DBogdan (Dragos.Bogdan@analog.com)
********************************************************************************
 * Copyright 2013(c) Analog Devices, Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of Analog Devices, Inc. nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. “AS IS” AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 * EVENT SHALL ANALOG DEVICES, INC. BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT

 * @param radio_cfg10 Contains additional configuration settings for the radio.
 * @param radio_cfg11 Contains further configuration settings for the radio.
 * @param image_reject_cal_phase Specifies the phase for image rejection
 * calibration.
 * @param image_reject_cal_amplitude Specifies the amplitude for image rejection
 * calibration.
 * @param mode_control Controls various modes of the device.
 * @param preamble_match Defines the preamble match settings.
 * @param symbol_mode Specifies the symbol mode settings.
 * @param preamble_len Defines the length of the preamble.
 * @param crc_poly0 Specifies the lower byte of the CRC polynomial.
 * @param crc_poly1 Specifies the upper byte of the CRC polynomial.
 * @param syncControl Controls synchronization settings.
 * @param sync_byte0 Specifies the first synchronization byte.
 * @param sync_byte1 Specifies the second synchronization byte.
 * @param sync_byte2 Specifies the third synchronization byte.
 * @param tx_base_adr Defines the base address for transmission.
 * @param rx_base_adr Defines the base address for reception.
 * @param packet_length_control Controls the packet length settings.
 * @param packet_length_max Specifies the maximum packet length.
 * @param static_reg_fix Indicates static register fix settings.
 * @param address_match_offset Specifies the offset for address matching.
 * @param address_length Defines the length of the address.
 * @param address_filtering0 Specifies the first address filtering setting.
 * @param address_filtering1 Specifies the second address filtering setting.
 * @param address_filtering2 Specifies the third address filtering setting.
 * @param address_filtering3 Specifies the fourth address filtering setting.
 * @param address_filtering4 Specifies the fifth address filtering setting.
 * @param address_filtering5 Specifies the sixth address filtering setting.
 * @param address_filtering6 Specifies the seventh address filtering setting.
 * @param address_filtering7 Specifies the eighth address filtering setting.
 * @param address_filtering8 Specifies the ninth address filtering setting.
 * @param address_filtering9 Specifies the tenth address filtering setting.
 * @param address_filtering10 Specifies the eleventh address filtering setting.
 * @param address_filtering11 Specifies the twelfth address filtering setting.
 * @param address_filtering12 Specifies the thirteenth address filtering
 * setting.
 * @param rssi_wait_time Defines the wait time for RSSI measurement.
 * @param testmodes Specifies the test modes for the device.
 * @param transition_clock_div Sets the clock divider for transitions.
 * @param reserved0 Reserved for future use.
 * @param reserved1 Reserved for future use.
 * @param reserved2 Reserved for future use.
 * @param rx_synth_lock_time Specifies the lock time for the RX synthesizer.
 * @param tx_synth_lock_time Specifies the lock time for the TX synthesizer.
 ******************************************************************************/
struct adf7023_bbram {
	uint8_t interrupt_mask0;                  // 0x100
	uint8_t interrupt_mask1;                  // 0x101
	uint8_t number_of_wakeups0;               // 0x102
	uint8_t number_of_wakeups1;               // 0x103
	uint8_t number_of_wakeups_irq_threshold0; // 0x104
	uint8_t number_of_wakeups_irq_threshold1; // 0x105
	uint8_t rx_dwell_time;                    // 0x106
	uint8_t parmtime_divider;                 // 0x107
	uint8_t swm_rssi_thresh;                  // 0x108
	uint8_t channel_freq0;                    // 0x109
	uint8_t channel_freq1;                    // 0x10A
	uint8_t channel_freq2;                    // 0x10B
	uint8_t radio_cfg0;                       // 0x10C
	uint8_t radio_cfg1;                       // 0x10D
	uint8_t radio_cfg2;                       // 0x10E
	uint8_t radio_cfg3;                       // 0x10F
	uint8_t radio_cfg4;                       // 0x110
	uint8_t radio_cfg5;                       // 0x111
	uint8_t radio_cfg6;                       // 0x112
	uint8_t radio_cfg7;                       // 0x113
	uint8_t radio_cfg8;                       // 0x114
	uint8_t radio_cfg9;                       // 0x115
	uint8_t radio_cfg10;                      // 0x116
	uint8_t radio_cfg11;                      // 0x117
	uint8_t image_reject_cal_phase;           // 0x118
	uint8_t image_reject_cal_amplitude;       // 0x119
	uint8_t mode_control;                     // 0x11A
	uint8_t preamble_match;                   // 0x11B
	uint8_t symbol_mode;                      // 0x11C
	uint8_t preamble_len;                     // 0x11D
	uint8_t crc_poly0;                        // 0x11E
	uint8_t crc_poly1;                        // 0x11F
	uint8_t syncControl;                      // 0x120
	uint8_t sync_byte0;                       // 0x121
	uint8_t sync_byte1;                       // 0x122
	uint8_t sync_byte2;                       // 0x123
	uint8_t tx_base_adr;                      // 0x124
	uint8_t rx_base_adr;                      // 0x125
	uint8_t packet_length_control;            // 0x126
	uint8_t packet_length_max;                // 0x127
	uint8_t static_reg_fix;                   // 0x128
	uint8_t address_match_offset;             // 0x129
	uint8_t address_length;                   // 0x12A
	uint8_t address_filtering0;               // 0x12B
	uint8_t address_filtering1;               // 0x12C
	uint8_t address_filtering2;               // 0x12D
	uint8_t address_filtering3;               // 0x12E
	uint8_t address_filtering4;               // 0x12F
	uint8_t address_filtering5;               // 0x130
	uint8_t address_filtering6;               // 0x131
	uint8_t address_filtering7;               // 0x132
	uint8_t address_filtering8;               // 0x133
	uint8_t address_filtering9;               // 0x134
	uint8_t address_filtering10;              // 0x135
	uint8_t address_filtering11;              // 0x136
	uint8_t address_filtering12;              // 0x137
	uint8_t rssi_wait_time;                   // 0x138
	uint8_t testmodes;                        // 0x139
	uint8_t transition_clock_div;             // 0x13A
	uint8_t reserved0;                        // 0x13B
	uint8_t reserved1;                        // 0x13C
	uint8_t reserved2;                        // 0x13D
	uint8_t rx_synth_lock_time;               // 0x13E
	uint8_t tx_synth_lock_time;               // 0x13F
};

#define ADF7023_TX_BASE_ADR 0x10
#define ADF7023_RX_BASE_ADR 0x10

/******************************************************************************/
/*************************** Types Declarations *******************************/
/******************************************************************************/

/***************************************************************************//**
 * @brief The `adf7023_dev` structure is designed to encapsulate the necessary
 * components for interfacing with the ADF7023 transceiver device. It
 * includes pointers to SPI and GPIO descriptors for managing
 * communication and control lines, as well as a structure to hold the
 * current configuration settings of the device. This structure is
 * essential for initializing and operating the ADF7023, providing a
 * centralized representation of the device's state and interface
 * connections.
 *
